public class Main {

    private static void printRules() {
        System.out.println("=================================================================================");
        System.out.println("Добро пожаловать в игру \"Реверси\"!");
        System.out.println("Координаты поля, куда нужно поставить фишку, вводятся в шахматной нотации с маленькой буквы.\n" +
                "Например: e4.\n" +
                "После каждого хода в консоль выводится текущее состояние поля, где:\n" +
                "● - белые фишки\n" +
                "○ - черные фишки\n" +
                "? - доступные поля для совершения хода текущего игрока.");
        System.out.println("=================================================================================");
    }

    public static void main(String[] args) {
        printRules();
        Game game = new Game();
        game.start();
    }
}